---
kind: property
id: P:Autodesk.Revit.DB.Visual.WallPaint.WallpaintFinish
source: html/68e76ff5-91fd-7db5-31b6-b65144c751b7.htm
---
# Autodesk.Revit.DB.Visual.WallPaint.WallpaintFinish Property

The property labeled "Finish" from the "WallPaint" schema.

## Syntax (C#)
```csharp
public static string WallpaintFinish { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".